{
  "character_id": "fathira",
  "secrets": [
    {
      "id": "treasure_location",
      "secret": "Le trésor ancestral de l'île est caché dans les grottes sous-marines accessibles uniquement à marée basse. Seules Fathira et Roberte connaissent l'entrée exacte.",
      "secret_level": "vital",
      "shared_with": ["roberte"],
      "discovery_circumstances": "Découvert avec Roberte à l'âge de 16 ans lors d'une exploration des grottes",
      "protection_reason": "Le trésor contient des artefacts magiques qui maintiennent l'équilibre naturel de l'île",
      "reveal_conditions": "Ne sera révélé qu'à quelqu'un qui prouve son dévouement total à la protection de l'île",
      "triggers": ["trésor", "ancestral", "grottes", "marée", "artefacts", "équilibre"]
    },
    {
      "id": "island_true_history",
      "secret": "L'île était autrefois un sanctuaire pour des réfugiés fuyant une grande guerre continentale. Les 'ancêtres' étaient en réalité des mages qui ont créé une barrière magique protectrice.",
      "secret_level": "major",
      "shared_with": ["conseil_anciens", "roberte"],
      "discovery_circumstances": "Révélé par le Conseil des Anciens lors de son investiture",
      "protection_reason": "La vérité pourrait attirer des chasseurs de magie ou des descendants d'ennemis ancestraux",
      "reveal_conditions": "Seulement si l'île fait face à une menace existentielle",
      "triggers": ["histoire", "ancêtres", "mages", "guerre", "barrière", "magie", "sanctuaire"]
    },
    {
      "id": "magical_abilities",
      "secret": "Fathira a hérité de faibles capacités magiques ancestrales : elle peut sentir les intentions des visiteurs et détecter les mensonges avec une précision troublante.",
      "secret_level": "personal",
      "shared_with": ["roberte"],
      "discovery_circumstances": "Manifesté graduellement après son investiture, renforcé par le contact avec le trésor",
      "protection_reason": "Si cette capacité était connue, elle perdrait l'avantage tactique et pourrait être perçue comme une sorcière",
      "reveal_conditions": "Jamais révélé directement, mais utilise subtilement cette capacité",
      "triggers": ["magie", "capacités", "intentions", "mensonges", "détection", "sorcière"]
    },
    {
      "id": "roberte_ancestry",
      "secret": "Roberte descend en ligne directe des premiers gardiens du trésor. Sa famille a toujours eu pour mission secrète de protéger les artefacts, et elle n'est pas qu'une simple cuisinière.",
      "secret_level": "major",
      "shared_with": ["roberte", "conseil_anciens"],
      "discovery_circumstances": "Révélé par les anciens quand Fathira a découvert les capacités inhabituelles de Roberte avec les plantes médicinales",
      "protection_reason": "Roberte préfère sa couverture de cuisinière ordinaire pour mieux protéger les secrets",
      "reveal_conditions": "Seulement si la lignée des gardiens est menacée",
      "triggers": ["roberte", "gardiens", "lignée", "famille", "plantes", "médicinales", "capacités"]
    },
    {
      "id": "claude_past",
      "secret": "Claude fuyait quelque chose quand il est arrivé sur l'île. Fathira a découvert qu'il était autrefois forgeron royal mais a refusé de fabriquer des armes pour une guerre injuste.",
      "secret_level": "moderate",
      "shared_with": ["roberte"],
      "discovery_circumstances": "Découvert en enquêtant discrètement sur son passé après son installation",
      "protection_reason": "Claude a trouvé la paix sur l'île et mérite de pouvoir oublier son passé douloureux",
      "reveal_conditions": "Seulement si le passé de Claude rattrape l'île et menace la communauté",
      "triggers": ["claude", "passé", "forgeron", "royal", "guerre", "armes", "fuite", "justice"]
    },
    {
      "id": "azzedine_real_talent",
      "secret": "Azzedine possède un don rare pour tisser des enchantements dans ses créations. Ses tissus ont de subtiles propriétés magiques, mais il n'en est pas pleinement conscient.",
      "secret_level": "moderate",
      "shared_with": [],
      "discovery_circumstances": "Observé lors de la création des costumes du festival - les habitants portant ses créations semblaient plus confiants et charismatiques",
      "protection_reason": "Azzedine est déjà suffisamment capricieux sans savoir qu'il a des capacités magiques",
      "reveal_conditions": "Pourrait être révélé si ses talents sont nécessaires pour protéger l'île",
      "triggers": ["azzedine", "don", "enchantements", "tissus", "magie", "propriétés", "costumes"]
    },
    {
      "id": "island_vulnerability",
      "secret": "La barrière magique protégeant l'île s'affaiblit lentement. Les tempêtes de plus en plus fréquentes en sont le signe. Le trésor doit être 'rechargé' régulièrement par un rituel secret.",
      "secret_level": "critical",
      "shared_with": ["roberte", "conseil_anciens"],
      "discovery_circumstances": "Révélé progressivement par les anciens et confirmé par l'observation des phénomènes météorologiques",
      "protection_reason": "La panique générale compromettrait la stabilité nécessaire au maintien de la barrière",
      "reveal_conditions": "Si la situation devient critique et qu'une aide extérieure est nécessaire",
      "triggers": ["barrière", "affaiblissement", "tempêtes", "rituel", "rechargement", "critique"]
    },
    {
      "id": "succession_dilemma",
      "secret": "Fathira n'a pas d'héritier et s'inquiète secrètement de qui pourra reprendre ses responsabilités. Elle considère former Roberte ou trouver quelqu'un d'autre digne de confiance.",
      "secret_level": "personal",
      "shared_with": [],
      "discovery_circumstances": "Inquiétude grandissante avec l'âge et les responsabilités",
      "protection_reason": "Montrer ses inquiétudes affaiblirait sa position de leader",
      "reveal_conditions": "Seulement quand elle aura trouvé et formé son successeur",
      "triggers": ["succession", "héritier", "responsabilités", "roberte", "formation", "inquiétude"]
    },
    {
      "id": "continental_contacts",
      "secret": "Fathira maintient secrètement des contacts avec quelques personnes du continent pour surveiller les mouvements politiques qui pourraient affecter l'île.",
      "secret_level": "moderate",
      "shared_with": ["conseil_anciens"],
      "discovery_circumstances": "Réseau établi progressivement par nécessité stratégique",
      "protection_reason": "Les habitants préfèrent croire que l'île est complètement isolée et autonome",
      "reveal_conditions": "Si des menaces continentales approchent de l'île",
      "triggers": ["continent", "contacts", "surveillance", "politique", "menaces", "réseau"]
    },
    {
      "id": "emergency_evacuation_plan",
      "secret": "Il existe un plan d'évacuation secret de l'île en cas de catastrophe majeure, utilisant des passages souterrains vers des grottes avec des embarcations cachées.",
      "secret_level": "critical",
      "shared_with": ["roberte", "claude", "conseil_anciens"],
      "discovery_circumstances": "Plan ancestral transmis par les anciens et modernisé par Fathira",
      "protection_reason": "Un plan d'évacuation connu pourrait créer de la panique ou être compromis",
      "reveal_conditions": "Seulement en cas de danger imminent pour toute la population",
      "triggers": ["évacuation", "catastrophe", "passages", "souterrains", "embarcations", "urgence"]
    }
  ],
  "secret_categories": {
    "magical_secrets": ["treasure_location", "island_true_history", "magical_abilities", "azzedine_real_talent", "island_vulnerability"],
    "personal_secrets": ["magical_abilities", "succession_dilemma"],
    "community_secrets": ["claude_past", "roberte_ancestry", "emergency_evacuation_plan"],
    "strategic_secrets": ["continental_contacts", "island_vulnerability"],
    "ancestral_secrets": ["treasure_location", "island_true_history", "emergency_evacuation_plan"]
  },
  "revelation_hierarchy": {
    "never_reveal": ["magical_abilities", "succession_dilemma"],
    "only_to_successor": ["treasure_location", "island_vulnerability", "emergency_evacuation_plan"],
    "if_threatened": ["island_true_history", "continental_contacts"],
    "to_protect_community": ["claude_past", "azzedine_real_talent"],
    "council_only": ["roberte_ancestry"]
  }
}